#include <EEPROM.h>

int addr = 0;
float val = 0;

/*****************************************************************************
 * Union คือชุดข้อมูลที่ตัวแปรแต่ละตัวใช้พื้นที่ร่วมกัน
 * ซึ่งในกรณีนี้ เราอยากเก็บค่า Float ซึ่งใช้ 4 Byte เราก็ต้องสร้าง Byte ซึ่งใช้ 4 Byte มา 4 ตัว
 *****************************************************************************/

union u_tag {
  byte b[4];
  float f;
} u;

void setup()
{
  delay(3000); // หน่วงเวลา 3 วินาที ก่อนเริ่มทำงานโปรแกรม
  
  Serial.begin(115200);
  while(!Serial) ;
  
  EEPROM.begin(512); // กำหนดขนาด EEPROM ให้มีขนาด 512 Byte

  // วนลูปอ่านค่า Byte ต่าง ๆ จาก EEPROM
  for(int i = 0; i < 4; i++){
    u.b[i] = EEPROM.read(addr + i);
  }
  
  Serial.println("---------- EEPROM Read  -----------");
}

void loop()
{
  Serial.println(u.f);
  delay(1000); // หน่วงเวลา 1 วินาที ก่อนจบการทำงานของรอบนี้
}
