#include <EEPROM.h>

int addr = 0; // กำหนดจุดเริ่มต้นที่จะทำการเขียน
float val = 0; // กำหนดค่าเริ่มต้นตัวแปร

/*****************************************************************************
 * Union คือชุดข้อมูลที่ตัวแปรแต่ละตัวใช้พื้นที่ร่วมกัน
 * ซึ่งในกรณีนี้ เราอยากเก็บค่า Float ซึ่งใช้ 4 Byte เราก็ต้องสร้าง Byte ซึ่งใช้ 4 Byte มา 4 ตัว
 *****************************************************************************/

union u_tag {
  byte b[4];
  float f;
} u;

void setup()
{
  delay(5000); // หน่วงเวลา 5 วินาที ก่อนเริ่มทำงานโปรแกรม
  
  Serial.begin(115200);
  while(!Serial) ;
  
  EEPROM.begin(512); // กำหนดขนาด EEPROM ให้มีขนาด 512 Byte
}

void loop()
{
  Serial.println(val); // แสดงค่าล่าสุดของตัวแปร val
  
  u.f = val; // กำหนดค่า u.f ให้มีค่าเท่ากับ val

  // วนลูปบันทึกค่า Byte ต่างๆของ Float ลงใน EEPROM
  for(int i = 0; i < 4; i++){
    EEPROM.write(addr + i , u.b[i]);
  }
  
  EEPROM.commit(); // บันทึกการเปลี่ยนแปลงทั้งหมด
  Serial.println("---------- EEPROM Write ----------");
  
  val++; // เพิ่มค่าตัวแปร val ทุกครั้งที่วนลูป
  delay(1000); // หน่วงเวลา 1 วินาที ก่อนจบการทำงานของรอบนี้
}
